butok/FNET/fnet_demos/common/startup/startup_mk64fn1/CMSIS/Include/device/fsl_device_registers.h
#elif (defined(CPU_MKL43Z128VLH4) || defined(CPU_MKL43Z256VLH4) || defined(CPU_MKL43Z128VMP4) || \
    defined(CPU_MKL43Z256VMP4))

#define KL43Z4_SERIES

/* CMSIS-style register definitions */
#include "device/MKL43Z4/MKL43Z4.h"
/* Extension register definitions */
#include "device/MKL43Z4/MKL43Z4_registers.h"
/* CPU specific feature definitions */
#include "device/MKL43Z4/MKL43Z4_features.h"

#elif (defined(CPU_MKL46Z128VLH4) || defined(CPU_MKL46Z256VLH4) || defined(CPU_MKL46Z128VLL4) || \
    defined(CPU_MKL46Z256VLL4) || defined(CPU_MKL46Z128VMC4) || defined(CPU_MKL46Z256VMC4) || \
    defined(CPU_MKL46Z256VMP4))

#define KL46Z4_SERIES

/* CMSIS-style register definitions */
#include "device/MKL46Z4/MKL46Z4.h"
/* Extension register definitions */
#include "device/MKL46Z4/MKL46Z4_registers.h"
/* CPU specific feature definitions */
#include "device/MKL46Z4/MKL46Z4_features.h"

#elif (defined(CPU_MKM14Z128AHH5) || defined(CPU_MKM14Z64AHH5))

#define KM14ZA5_SERIES

/* CMSIS-style register definitions */
#include "device/MKM14ZA5/MKM14ZA5.h"
/* Extension register definitions */
#include "device/MKM14ZA5/MKM14ZA5_registers.h"
/* CPU specific feature definitions */
#include "device/MKM14ZA5/MKM14ZA5_features.h"

#elif (defined(CPU_MKM33Z128ALH5) || defined(CPU_MKM33Z64ALH5) || defined(CPU_MKM33Z128ALL5) || \
    defined(CPU_MKM33Z64ALL5))

#define KM33ZA5_SERIES

/* CMSIS-style register definitions */
#include "device/MKM33ZA5/MKM33ZA5.h"
/* Extension register definitions */
#include "device/MKM33ZA5/MKM33ZA5_registers.h"
/* CPU specific feature definitions */
#include "device/MKM33ZA5/MKM33ZA5_features.h"

#elif (defined(CPU_MKM34Z128ALL5))

#define KM34ZA5_SERIES

/* CMSIS-style register definitions */
#include "device/MKM34ZA5/MKM34ZA5.h"
/* Extension register definitions */
#include "device/MKM34ZA5/MKM34ZA5_registers.h"
/* CPU specific feature definitions */
#include "device/MKM34ZA5/MKM34ZA5_features.h"

#elif (defined(CPU_MKV10Z16VFM7) || defined(CPU_MKV10Z16VLC7) || defined(CPU_MKV10Z16VLF7) || \
    defined(CPU_MKV10Z32VFM7) || defined(CPU_MKV10Z32VLC7) || defined(CPU_MKV10Z32VLF7))

#define KV10Z7_SERIES

/* CMSIS-style register definitions */
#include "device/MKV10Z7/MKV10Z7.h"
/* Extension register definitions */
#include "device/MKV10Z7/MKV10Z7_registers.h"
/* CPU specific feature definitions */
#include "device/MKV10Z7/MKV10Z7_features.h"

#elif (defined(CPU_MKV30F128VFM10) || defined(CPU_MKV30F64VFM10) || defined(CPU_MKV30F128VLF10) || \
    defined(CPU_MKV30F64VLF10) || defined(CPU_MKV30F128VLH10) || defined(CPU_MKV30F64VLH10))

#define KV30F12810_SERIES

/* CMSIS-style register definitions */
#include "device/MKV30F12810/MKV30F12810.h"
/* Extension register definitions */
#include "device/MKV30F12810/MKV30F12810_registers.h"
/* CPU specific feature definitions */
#include "device/MKV30F12810/MKV30F12810_features.h"

#elif (defined(CPU_MKV31F128VLH10) || defined(CPU_MKV31F128VLL10))

#define KV31F12810_SERIES

/* CMSIS-style register definitions */
#include "device/MKV31F12810/MKV31F12810.h"
/* Extension register definitions */
#include "device/MKV31F12810/MKV31F12810_registers.h"
/* CPU specific feature definitions */
#include "device/MKV31F12810/MKV31F12810_features.h"

#elif (defined(CPU_MKV31F256VLH12) || defined(CPU_MKV31F256VLL12))

#define KV31F25612_SERIES

/* CMSIS-style register definitions */
#include "device/MKV31F25612/MKV31F25612.h"
/* Extension register definitions */
#include "device/MKV31F25612/MKV31F25612_registers.h"
/* CPU specific feature definitions */
#include "device/MKV31F25612/MKV31F25612_features.h"

#elif (defined(CPU_MKV31F512VLH12) || defined(CPU_MKV31F512VLL12))

#define KV31F51212_SERIES

/* CMSIS-style register definitions */
#include "device/MKV31F51212/MKV31F51212.h"
/* Extension register definitions */
#include "device/MKV31F51212/MKV31F51212_registers.h"
/* CPU specific feature definitions */
#include "device/MKV31F51212/MKV31F51212_features.h"

#elif (defined(CPU_MKV40F128VLH15) || defined(CPU_MKV40F128VLL15) || defined(CPU_MKV40F256VLH15) || \
    defined(CPU_MKV40F256VLL15) || defined(CPU_MKV40F64VLH15))

#define KV40F15_SERIES

/* CMSIS-style register definitions */
#include "device/MKV40F15/MKV40F15.h"
/* Extension register definitions */
#include "device/MKV40F15/MKV40F15_registers.h"
/* CPU specific feature definitions */
#include "device/MKV40F15/MKV40F15_features.h"

#elif (defined(CPU_MKV43F128VLH15) || defined(CPU_MKV43F128VLL15) || defined(CPU_MKV43F64VLH15))

#define KV43F15_SERIES

/* CMSIS-style register definitions */
#include "device/MKV43F15/MKV43F15.h"
/* Extension register definitions */
#include "device/MKV43F15/MKV43F15_registers.h"
/* CPU specific feature definitions */
#include "device/MKV43F15/MKV43F15_features.h"

#elif (defined(CPU_MKV44F128VLH15) || defined(CPU_MKV44F128VLL15) || defined(CPU_MKV44F64VLH15))

#define KV44F15_SERIES

/* CMSIS-style register definitions */
#include "device/MKV44F15/MKV44F15.h"
/* Extension register definitions */
#include "device/MKV44F15/MKV44F15_registers.h"
/* CPU specific feature definitions */
#include "device/MKV44F15/MKV44F15_features.h"

#elif (defined(CPU_MKV45F128VLH15) || defined(CPU_MKV45F128VLL15) || defined(CPU_MKV45F256VLH15) || \
    defined(CPU_MKV45F256VLL15))

#define KV45F15_SERIES

/* CMSIS-style register definitions */
#include "device/MKV45F15/MKV45F15.h"
/* Extension register definitions */
#include "device/MKV45F15/MKV45F15_registers.h"
/* CPU specific feature definitions */
#include "device/MKV45F15/MKV45F15_features.h"

#elif (defined(CPU_MKV46F128VLH15) || defined(CPU_MKV46F128VLL15) || defined(CPU_MKV46F256VLH15) || \
    defined(CPU_MKV46F256VLL15))

#define KV46F15_SERIES

/* CMSIS-style register definitions */
#include "device/MKV46F15/MKV46F15.h"
/* Extension register definitions */
#include "device/MKV46F15/MKV46F15_registers.h"
/* CPU specific feature definitions */
#include "device/MKV46F15/MKV46F15_features.h"

#elif (defined(CPU_SKEAZ128MLH) || defined(CPU_SKEAZ64MLH) || defined(CPU_SKEAZ128MLK) || \
    defined(CPU_SKEAZ64MLK))

#define SKEAZ1284_SERIES

/* CMSIS-style register definitions */
#include "device/SKEAZ1284/SKEAZ1284.h"
/* Extension register definitions */
#include "device/SKEAZ1284/SKEAZ1284_registers.h"
/* CPU specific feature definitions */
#include "device/SKEAZ1284/SKEAZ1284_features.h"

#else
#error "No valid CPU defined!"
#endif

#endif /* __FSL_DEVICE_REGISTERS_H__ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
